//1. Известно, что 1 дюйм равен 2.54 см. Разработать при­ложение, переводящие дюймы в сантиметры и наоборот. Диалог с пользователем реализовать через систему меню.


//2. Пользователь вводит три числа. Если самое большое из трех - четное, то все числа суммируются и сумма выводится на экран. А если самое большое - нечетное, то все числа перемножаются. 

//3. Пользователь вводит радиус окружности. На экран выводится меню. 
//1 - площадь круга
//2 - длина окружности
//3 - площадь квадрата, в который вписана окружность

//Пользователь выбирает пункт и получает на экран соответсвующее решение.

//4. Пользователь вводит номер дня недели, а программа выводит его словесное наименование. Допустим 2 - вторник

//5. Пользователь вводит длины сторон треугольника, о программа проверяет возможность существование треугольника


//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//Задача 1.

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
		const float dyim=2.54 ;
		float a;
		cout << "Конвертор едениц\n";
		cout << "--------------\n";
		cout << "1-Сантиметры\n";
		cout << "2-Дюймы\n";
		cout << "-----------\n";
		int b;
		cin >> b;
		if (b == 1) {

			cout << "Введите число\n";
			cin >> a;
			cout << "\n";
			cout << a << "см =" << a / dyim << "дюйм\n";
		}
		else if (b == 2) {
			cout << "Введите число\n";
			cin >> a;
			cout << "\n";
			cout << a << "дм=" <<a*dyim<<"см\n" ;
		}
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

//Задача 4.



#include <iostream>
#include <conio.h>
using namespace std;


int main()
{
	setlocale(LC_ALL, "Russian");
	int day;
	cout << "Введите день недели\n";
	cin >> day;

	switch (day)
	{
	case 1:
		cout << "Понедельник\n";
		break;

		
	case 2:
		cout << "Вторнник\n";
		break;

	case 3:
		cout << "Среда\n";
		break;


	case 4:
		cout << "Четверг\n";
		break;

	case 5:
		cout << "Пятница\n";
		break;


	case 6:
		cout << "Суббота\n";
		break;

	case 7:
		cout << "Воскресенье\n";
		break;


	}
	
}

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

//Задача 3.

#include <iostream>
#include <cmath>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian"); 
	float a;
	cout << "Калькулятор по радиусу окружности \n";
	cout << "--------------\n";
	cout << "1-Площадь круга\n";
	cout << "2-Длина окружности\n";
	cout << "3-Площадь квадрата, в который вписана окружность\n";
	cout << "--------------\n";
	int b;
	cin >> b;
	if (b == 1) {

		cout << "Введите радиус окружности\n";
		int rad;
		cin >> rad;
		cout << "\n";
		cout <<  "Площадь круга = \n" << pow (rad,2) * 3.14 << "м^2\n";
	}
	else if (b == 2) {
		
		cout << "Введите радиус окружности\n";
		int rad;
		cin >> rad;
		cout << "\n";
		cout << "Длина окружности = \n" << 2 * 3.14 * rad << "см\n";
		


	}
	if (b == 3) {
		cout << "Введите радиус окружности\n";
		int rad;
		cin >> rad;
		cout << "\n";
		cout << "Площадь квадрата, в который вписана окружность = \n" << pow(rad, 2) * 4 << "м^2\n";


	}
}


//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
