//ДЗ: 
//1. Пользователь вводит с клавиатуры числа пока не введет 0. Программа подсчитывает среднее только тех, что делятся на 4. 

//2. Компьютер загадывает число от 0 до 10. Задача игрока угадать число за 3 попытки. 

//3. Пользователь вводит 10 чисел, программа считает сумму первых 5 и сумму вторых 5 чисел. Программа сравнивает полученные суммы и выводит сообщение - равные ли они или сумма первых больше суммы вторых 5



//Задача 1.
//////////////////////////////////////////////////////////////////////////////////

#include <iostream>

using namespace std;


int main()
{
	setlocale(LC_ALL, "Russian");
	int sum=0;
	int num = 0;
	int x=0; 
	
	cout << "Ведите числа , для выхода введите 0" << endl; 
	do {
		cout << "Введите число  = " ; 
		cin >> x;
		if (x == 0)break;
		if (x % 4 == 0)
		{
			sum += x;
			num++;
		}

	} 
	while (x!=0);
	if (num != 0)
		cout << "Среднее арифметическое чисел  , делящихся на 4 =  "<< double(sum) / num;
	
	
}

//////////////////////////////////////////////////////////////////////////////////
//Задача 2.
//////////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <time.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian"); 
	srand((unsigned)time(NULL)); 
	int number = rand() % 10 ; 
	int user_num;  

	
	do
	{
		cout << "---------------\n";
		cout << "Введите число: ";
		cin >> user_num;
		cout << "---------------\n";
		if (number > user_num) cout << "Загаданное число больше" << endl;
		
		if (number < user_num) cout << "Загаданное число меньше" << endl;
		
		if (number == user_num) 
		{
			cout << "Число угадано!" << endl;
			
			return 0;
		}
	} while (number != user_num);

	return 0;
}

//////////////////////////////////////////////////////////////////////////////////
//Задача 3.
//////////////////////////////////////////////////////////////////////////////////

#include <iostream>

using namespace std;


int main(int argc, char *argv[])
{
	setlocale(LC_ALL, "Russian");
	int N, i, j;
	
	cout << "--------------\n";
	cout << " Введите размер массива =   ";
	cin >> N;
	cout << "--------------\n";
	int a[10];
	for (i = 0; i < N; i++)
	{
		cout << " Введите [" << i << "] число : ";
		cin >> a[i];
	}
	for (i = 0; i < N; i++)
	{
		cout << "a[" << i << "]=" << a[i] << endl;
	}
	int sum1 = a[0] + a[1] + a[2] + a[3] + a[4];
	cout << "-----------------------------------------\n";
	cout << " Сумма первых 5 чисел  = " << sum1 <<  endl;

	int sum2 = a[5] + a[6] + a[7] + a[8] + a[9];
	cout << "-----------------------------------------\n";
	cout << " Сумма вторых 5-ти чисел  = " << sum2 <<  endl;

	cout << "-----------------------------------------\n";
	if (sum1 == sum2) 
		cout << "Сумма первых 5-ти равна сумме вторых 5-ти \n";
	if (sum1<sum2)
		cout << "Сумма первых 5-ти меньше суммы вторых 5-ти \n";
	if (sum1 > sum2)
		cout << "Сумма первых 5-ти больше суммы вторых 5-ти \n";

	return 0;
}

//////////////////////////////////////////////////////////////////////////////
