//Пользователь создает одномерный массив. Программа считает произведение первого и последнего элемента, а также сумму элементов между первым и последним. 

#include <iostream>

using namespace std;


int main(int argc, char *argv[])
{
	setlocale(LC_ALL, "Russian");
	int N, i, j;
	cout << "--------------\n";
	cout << " Введите размер массива =   ";
	cin >> N;
	cout << "--------------\n";
	int a[10];
	for (i = 0; i < N; i++)
	{
		cout << " Введите [" << i << "] число : ";
		cin >> a[i];
	}
	for (i = 0; i < N; i++)
	{
		cout << "a[" << i << "]=" << a[i] << endl;
	}
	cout << "-----------------------------------------\n";
	cout << " Произведение первого и последнего элемента = " << a[0] * a[9] << "\n";
	cout << "-----------------------------------------\n";
	cout << " Сумма чисел между первым и последним элементом = " << a[1] + a[2] + a[3] + a[4] + a[5] + a[6] + a[7] + a[8];
	
	return 0;
}
