//1. Пользователь вводит координты 2 окружностей и радиус. Определить - в каком отношении находятся эти окружности. Формулу нахожения расстояния между двумя точками на плоскости ищем в интернете! 

//2. Пользователь вводит массив из 10 чисел, а программа выводит на экран только те, которые делятся на 3 и при этом деляться на 5

//Задача 1.
////////////////////////////////////////////////////////////////////////////
#include <iostream>
#include <cmath>
using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");
	
		cout << "------------------------------------ \n";
		cout << "Введите координаты первой окружности = \n";
		int x1;
		cin >> x1;
		int y1;
		cin >> y1;

		cout << "Введите радиус =  \n";
		int rad1;
		cin >> rad1;

		cout << "Введите координаты второй окружности = \n";
		int x2;
		cin >> x2;
		int y2;
		cin >> y2;

		cout << "Введите радиус =  \n";
		int rad2;
		cin >> rad2;

		cout << "\n";
		cout << "Отношение окружностей = " << "  = " <<     " \n";
	





}
///////////////////////////////////////////////////////////////////////////////////////
//Задача 2.

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL,"ru"); 
	int a,b ,c,d, e, f ,g ,k,l, o ;
	cout << "Введите 1 число : " << endl;
	cin >> a ; 
	cout << "Введите 2 число : " << endl;
	cin >> b;
	cout << "Введите 3 число : " << endl;
	cin >> c;
	cout << "Введите 4 число : " << endl;
	cin >> d;
	cout << "Введите 5 число : " << endl;
	cin >> e;
	cout << "Введите 6 число : " << endl;
	cin >> f;
	cout << "Введите 7 число : " << endl;
	cin >> g;
	cout << "Введите 8 число : " << endl;
	cin >> k;
	cout << "Введите 9 число : " << endl;
	cin >> l;
	cout << "Введите 10 число : " << endl;
	cin >> o;
	if (a % 3 == 0 && a % 5 == 0)
		cout <<" " << a ;

	if (b % 3 == 0 && b % 5 == 0)
		cout << " " << b;

	if (c % 3 == 0 && c % 5 == 0)
		cout << " " << c;

	if (d % 3 == 0 && d % 5 == 0)
		cout << " " << d;

	if (e % 3 == 0 && e % 5 == 0)
		cout << " " << e;

	if (f % 3 == 0 && f % 5 == 0)
		cout << " " << f;

	if (g % 3 == 0 && g % 5 == 0)
		cout << " " << b;

	if (k % 3 == 0 &&k % 5 == 0)
		cout << " " << k;

	if (l % 3 == 0 && l % 5 == 0)
		cout << " " << b;

	if (o % 3 == 0 && o % 5 == 0)
		cout << " " << o;

}
////////////////////////////////////////////////////////////////////////////////////
